# ФАЙЛ: variables
# КОМЕНТАРИЙ: Хранит константы, переменные и пути 

# ======================== Константы ============================= #
K = 1.5 # ----------> Коэфицент k из формулы x = Cx*k*(pv**2)/2 
G = 9.81 # ---------> Скорость свуободного падения
h = 0.001 # --------> Шаг времени
S = 0.00785 # ------> Площадь тела

# ======================== Переменные ============================= #
MASS = 100 # -----------------> Начальная масса
FUEL = 4000 # ----------------> Начальное топливо
FUEL_CONSUMPION = 2 # --------> Расход топлива в секунду кг/c
RHO_AT_SEA_LEVEL = 1.225 # ---> Плотность воздуха

# =========================== Пути ================================ #
xlsx_path = '/workspaces/almaz/eiler/data/data.xlsx'
